# Домашнее задание к работе 6


## Условие задачи
Написать программу, которая для введенного года определяет количество дней в нем. 
## 1. Алгоритм и блок-схема

### Алгоритм
1. **Начало**
2. Задать переменные:
   - `i` — целое число
3. Задание условий для переменной i:
   - `for (i = 0; i <= 10; i++)`
4. Вычисляем значения:
   - `double x = 1.0 + i * 0.1;`
   - `double sin_value = sin(x);`
   - `sum += sin_value;`
6. Вывести результаты проверки.
7. **Конец**


## 2. Реализация программы

```
#include <stdio.h>
#include <math.h>
#include <locale.h>

int main() {
    setlocale(LC_ALL, "RUS");
    double sum = 0.0;
    int i;

    // Цикл for с целочисленным счетчиком (0 до 10)
    for (i = 0; i <= 10; i++) {
        double x = 1.0 + i * 0.1;   // Вычисляем x = 1.0, 1.1, 1.2, ..., 2.0
        double sin_value = sin(x);  // Вычисляем синус
        sum += sin_value;           // Добавляем к сумме
        printf("sin(%.1f) = %.6f\n", x, sin_value);  // Выводим результат
    }

    printf("Сумма = %.6f\n", sum);  // Итоговая сумма

    return 0;
}
```

## 3. Результаты работы программы

```
sin(1,0) = 0,841471
sin(1,1) = 0,891207
sin(1,2) = 0,932039
sin(1,3) = 0,963558
sin(1,4) = 0,985450
sin(1,5) = 0,997495
sin(1,6) = 0,999574
sin(1,7) = 0,991665
sin(1,8) = 0,973848
sin(1,9) = 0,946300
sin(2,0) = 0,909297
Сумма = 10,431904
```

## 4. Информация о разработчике

Прохорова Виктория, бТИИ-251
